---
kind: type
id: T:Autodesk.Revit.DB.ContentNode
source: html/5752e4cb-f427-5c73-9a25-6978db12bead.htm
---
# Autodesk.Revit.DB.ContentNode

This class represents a generic content node in a model-exporting process.

## Syntax (C#)
```csharp
public class ContentNode : RenderNode
```

## Remarks
Members of this class implement properties and methods
 common to all content classes, such as RPC and Light nodes.
 Attributes of a content note can be accessed via an Asset object.